# ClassificationNotSetInFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..ClassificationNotSetInFamily Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
A calculation did not complete because the Classification parameter in the Mechanical Equipment family is not set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ClassificationNotSetInFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClassificationNotSetInFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ClassificationNotSetInFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace